#pragma once
#include <string>
#include <vector>

struct CityItem {
  std::wstring name;
  int id;
};

static const std::vector<CityItem> g_Cities = {
    {L"کل ایران", 715}, {L"تهران", 1},     {L"کرج", 2},       {L"مشهد", 3},
    {L"اصفهان", 4},     {L"تبریز", 5},     {L"شیراز", 6},     {L"اهواز", 7},
    {L"قم", 8},         {L"کرمانشاه", 9},  {L"ارومیه", 10},   {L"زاهدان", 11},
    {L"رشت", 12},       {L"کرمان", 13},    {L"همدان", 14},    {L"اراک", 15},
    {L"یزد", 16},       {L"اردبیل", 17},   {L"بندرعباس", 18}, {L"قزوین", 19},
    {L"زنجان", 20},     {L"مازندران", 22}, {L"دزفول", 23},    {L"بوشهر", 25},
    {L"بروجرد", 26},    {L"خرم آباد", 27}, {L"سنندج", 28},    {L"کاشان", 30},
    {L"ایلام", 32},     {L"بیرجند", 34},   {L"سمنان", 35},    {L"شهرکرد", 36},
    {L"یاسوج", 38},     {L"بجنورد", 39},
};
